from dataclasses import field, dataclass
from environs import Env


env = Env()

user_data = {}


@dataclass
class AdminList:
    id: dict[str, int] = field(default_factory=dict)


admin_list = AdminList()
admin_list.id['slava'] = env.str('ADMIN_ID_1')
admin_list.id['slava'] = env.str('ADMIN_ID_2')


GREETING = 'Вітаємо у чатботі для надання ветеринарної допомоги та основних рекомендацій'

WARNING = 'Цей розділ на етапі розробки!'

BUTTONS_INFO = {
    'Записатися на прийом до ветеринара 📅': 'appointment',
    'Виклик ветеринара додому 🚑': 'doctors_call',
    'Консультації щодо догляду за тваринами 🐕': 'recomendations',
    'Магазин 🏪': 'store',
    'Про лікаря 👨‍⚕️': 'doctor',
}

PET_LIST = {
    'Котик': 'cat',
    'Собачка': 'dog',
    'Пташка': 'bird',
}

STEP_DATE = ['Оберіть дату', 'choose_date']

TIME = {
    '09:00': '09:00',
    '09:30': '09:30',
    '10:00': '10:00',
    '10:30': '10:30',
    '11:00': '11:00',
    '11:30': '11:30',
    '12:00': '12:00',
    '12:30': '12:30',
    '13:00': '13:00',
    '13:30': '13:30',
    '14:00': '14:00',
    '14:30': '14:30',
    '15:00': '15:00',
    '15:30': '15:30',
}

CALL_TIME = {
    'В першій половині дня': 'first_part',
    'В другій половині дня': 'second_part',
}

VIRTUAL_ASSISTANT = '<pre>Вітаю!\n' \
                    'Я віртуальний помічник лікаря $$$.\n' \
                    'Моя мета допомогти Вам в догляді за Вашим улюбленцем.\n' \
                    'І хоча лікар багато чому мене навчив, я ніколи не зможу його замінити!\n' \
                    'Тому не зволікайте з лікарською допомогою Вашому улюбленцю!\n\n' \
                    'А тепер, будь ласка, опишіть вашу поточну проблему!</pre>'

PROBLEM = '<pre>Для надання вам кваліфікованої допомоги - будь ласка опишіть вашу поточну проблему ' \
          '(від 10 до 100 символів в повідомленні).</pre>'

CANT_RESOLVE = '<pre>Нажаль, я не зможу зараз дати точну відповідь.\n' \
               'Але ми можемо залишити запитання лікарю  і він обов\'язково Вам відповість!</pre>'
